# YOLOv5s-MGCT: Improved YOLOv5s for rail track obstacle detection
# Paper: 改进YOLOv5s的轨道障碍物检测模型轻量化研究 (Li Ang, 2023)
nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]
backbone:
  - [-1, 1, Conv,      [64, 6, 2, 2]]   # 0  P1/2  CBS stem
  - [-1, 1, GhostConv, [128, 3, 2]]     # 1  P2/4  Ghost_CBS
  - [-1, 3, C3Ghost,   [128]]            # 2        Ghost_C3_1
  - [-1, 1, GhostConv, [256, 3, 2]]     # 3  P3/8  Ghost_CBS
  - [-1, 6, C3Ghost,   [256]]            # 4        Ghost_C3_2 (P3)
  - [-1, 1, GhostConv, [512, 3, 2]]     # 5  P4/16 Ghost_CBS
  - [-1, 9, C3Ghost,   [512]]            # 6        Ghost_C3_3 (P4)
  - [-1, 1, GhostConv, [1024, 3, 2]]    # 7  P5/32 Ghost_CBS
  - [-1, 3, C3Ghost,   [1024]]           # 8        Ghost_C3_1
  - [-1, 1, CoordAtt,  [1024]]           # 9        CA Block
  - [-1, 1, SPPF,      [1024, 5]]        # 10       SPPF
head:
  - [-1,  1, GhostConv,   [512, 1, 1]]           # 11
  - [-1,  1, nn.Upsample, [None, 2, 'nearest']]   # 12
  - [[-1, 6], 1, Concat,  [1]]                    # 13 cat P4
  - [-1,  3, C3Ghost,     [512, False]]           # 14
  - [-1,  1, GhostConv,   [256, 1, 1]]           # 15
  - [-1,  1, nn.Upsample, [None, 2, 'nearest']]   # 16
  - [[-1, 4], 1, Concat,  [1]]                    # 17 cat P3
  - [-1,  3, C3Ghost,     [256, False]]           # 18 P3/8-small
  - [-1,  1, GhostConv,   [256, 3, 2]]           # 19
  - [[-1, 15], 1, Concat, [1]]                    # 20 cat P4
  - [-1,  3, C3Ghost,     [512, False]]           # 21 P4/16-medium
  - [-1,  1, GhostConv,   [512, 3, 2]]           # 22
  - [[-1, 11], 1, Concat, [1]]                    # 23 cat P5
  - [-1,  3, C3Ghost,     [1024, False]]          # 24 P5/32-large
  - [[18, 21, 24], 1, Detect, [nc]]               # 25 Detect
